Repository: 84000/data-translation-memory
Catalog: toh248-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྣམས་དང་ལྡན་པར་གྱུར་ཀྱང་སྦྱིན་པ་ལས་ཉམས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་མེད་པ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ་གང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་མངོན་པར་བརྩོན་པ་དེས་ཇི་ལྟར་སྦྱིན་པ་སྦྱིན་པར་བྱ། སྦྱིན་པ་གང་སྦྱིན་པར་བྱ། སྦྱིན་པ་ཇི་ཙམ་ཞིག་སྦྱིན་པ་སྦྱིན་པར་བྱ།
en: “Śāriputra, if whatever alms placed in their alms bowls are received in accord with the Dharma and by means of the Dharma, they should share them with their fellow practitioners of pure conduct. If someone comes along and asks for alms bowls or for robes, if they possess more than the three robes prescribed by the Buddha, they should give them away. If they have fewer than the three robes, they should not give away those robes that they rely upon to maintain pure conduct. Why? Because the Thus-Gone One has said that the three robes should not be given away. Śāriputra, if bodhisattvas prioritize the one who asks by giving away the three robes, they do not keep the practice of having few desires. Therefore, Śāriputra, bodhisattvas who renounce their homes should immerse themselves in the Dharma and exert themselves in it. Śāriputra, bodhisattvas should cultivate love for all sentient beings at every single moment. This is what is meant by the knowledge of generosity.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་གྱི་གནས་ནས་ མངོན་པར་བྱུང་བ་གང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་མངོན་པར་བརྩོན་པ་གང་ཡིན་པ་དེས་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་ཏེ་གནས་པར་བྱ་བ་དང་། ཆོ་ག་དང་། སྤྱོད་ཡུལ་དང་། སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པར་བྱ་བ་དང་། ཁ་ན་མ་ཐོ་བ་ཕྲ་རབ་ཙམ་ལ་འཇིགས་པར་ལྟ་བ་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་ཡོངས་སུ་དག་པ་དང་། འཚོ་བ་ཡོངས་སུ་དག་པས་བསླབ་པ་ཡང་དག་པར་བླངས་ཏེ་ བསླབ་པར་བྱའོ། ། དེས་ལུང་ནོད་པ་ལྷུར་བྱ་བ་དང་། ཁ་ཏོན་ལྷུར་བྱ་བ་དང་། དགོན་པ་ན་གནས་པ་ལྷུར་བྱ་བ་དང་། ཇི་ལྟར་ཐོས་པ་དང་། ཇི་ལྟར་ཀུན་ཆུབ་པར་བྱས་པའི་ཆོས་དག་གཞན་དག་ལ་རྒྱ་ཆེར་བསྟན་པར་བྱ་བ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་པོ་དང་། ཆོས་ཀྱི་སྦྱིན་བདག་ཏུ་བྱའོ། །
en: “To what extent, Śāriputra, should one be known as a caretaker bodhisattva? Bodhisattvas should be caretakers in accord with the Dharma and caretakers of the thus-gone ones’ stūpas. They should be respectful toward preceptors and teachers. They should practice the application of diligence in such a way that, until the very end of their life, they dispel sloth and torpor. Śāriputra, these are the duties of caretaker bodhisattvas.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་བ་བྱས་ཏེ།
en: “Śāriputra, what is the knowledge of the pursuit of erudition? Śāriputra, you should know that those who do not strive for erudition after having set their minds on the awakening of the buddhas are not bodhisattvas who speak truthfully. Śāriputra, one cannot awaken in a perfect manner to unexcelled and perfect buddhahood through mere words. Rather, it is through insight that one can awaken in a perfect manner to unexcelled and perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས། ཤཱ་རིའི་བུ་རབ་ཏུ་བྱུང་བར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་བསྟན་ན་ འདི་ཉིད་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་དེ
en: “Where does insight come from? Insight comes from erudition. Śāriputra, this is why you must gain direct experience and knowledge. Seeking to sow doubts in erudite beings who follow the Bodhisattva Vehicle, wicked māras will create obstacles to the awakening of bodhisattvas who benefit sentient beings. Śāriputra, when bodhisattvas do not strive for erudition after having set their minds on awakening, this is the doing of wicked māras. Therefore, Śāriputra, those who wish to know all the deeds of the māras should practice the application of diligence. They should not prioritize words. They should understand the ways of the wise, and the ways that are renowned within the entire world. Thus Śāriputra, through diligence and discipline that rise above all worlds, they will awaken in a perfect manner to unexcelled and perfect buddhahood .

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ནི་རབ་ཏུ་བྱུང་བས་ཟང་ཟིང་གི་སྦྱིན་པ་བྱ་བར་མ་གནང་ངོ་། །
en: “Śāriputra, those who do not establish these states with great striving and perseverance will drift away from the ten powers of a thus-gone one, from the wisdom that rises above all worlds, and from their aspirations. Therefore, Śāriputra, bodhisattvas should speak words that please all sentient beings—they should not speak for their own benefit. Bodhisattvas should not practice inferior types of diligence.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་ང་རབ་ཏུ་བྱུང་བར་གྱུར་ནས་
en: “Śāriputra, one out of a thousand are accomplished, or none are. Śāriputra, one out of ten thousand, twenty thousand, thirty thousand, forty thousand, fifty thousand, or ten billion are accomplished, or none are. Why? Because, Śāriputra, it is difficult for those who abide by this bodhisattva conduct to reach emancipation.

source: བསྐལ་པ་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་པར་ཁྱིམ་པའམ་རབ་ཏུ་བྱུང་བའི་ཆོས་གོས་དང་། བསོད་སྙོམས་ལ་མགྲོན་དུ་བོས་པར་མ་དགོངས་སོ། ། གཞན་དུ་ན་ཆོས་ཁོ་ན་ལ་བསྟི་སྟང་དང་། བླ་མར་བྱས་ཏེ་ཉེ་བར་བརྟེན་ནས་གནས་པར་བྱའོ། །
en: “Therefore, Śāriputra, those who strive for unexcelled and perfect buddhahood should form this resolve: ‘For the sake of all sentient beings, I will endure what is hard to endure and bear what is hard to bear. I will joyfully exert myself to seek out the Dharma—not to seek out pleasure.’ Why? Because those who seek out the Dharma seek out wisdom. When they acquire what they wished for, they do not become conceited or pompous. Therefore, sentient beings who follow the Bodhisattva Vehicle should prioritize insight, not pleasure. Śāriputra, this is how bodhisattvas should exert themselves in giving the Dharma.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་ངའི་ཉན་ཐོས་རྣམས་ཀྱིས་ཆོས་ཀྱི་ནོར་ཅན་དུ་བྱའི་ཟང་ཟིང་གི་ནོར་ཅན་དུ་ནི་མི་བྱའོ། །
en: “Śāriputra, how should bodhisattvas seek out the knowledge of erudition? Śāriputra, bodhisattvas should send four persons in the four directions, telling them, ‘Go, and spread the excellent teaching that you have heard.’ They should also send four other persons by telling them, ‘You should go forth and act as caretakers and nurses for them.’ Śāriputra, bodhisattvas should pervade the four directions with thoughts of love and focus their minds on pursuing the Dharma. They should go wherever the Dharma can be heard. Śāriputra, this is how bodhisattvas should seek out the Dharma. This is the knowledge of seeking out erudition. Śāriputra, these four qualities lead bodhisattvas to the accomplishment of unexcelled and perfect buddhahood.

source: ཤཱ་རིའི་བུ་གང་ཡང་ལྷུང་བཟེད་དུ་འོངས་པའི་རྙེད་པ་ཆོས་དང་འཐུན་པ་ཆོས་ཀྱིས་རྙེད་པར་འགྱུར་ན་
en: “Śāriputra, in ancient times, there was a bodhisattva named Wise Diligence. At that time, there was a thus-gone, worthy, perfect buddha named Sujāta. After he had passed into parinirvāṇa, but while his teachings remained, the bodhisattva Wise Diligence was travelling by means of prostration to his stūpa, when he arrived before the Bodhi tree. When he saw the Bodhi tree, he wept uncontrollably and exclaimed, ‘The blessed, thus-gone, worthy, perfect Buddha awakened in a perfect manner to unexcelled and perfect buddhahood while staying here. In this place, that blessed, thus-gone, worthy, perfect Buddha subdued Māra, his armies, and their mounts. For the sake of this lion’s throne, the blessed, thus-gone, worthy, perfect Buddha underwent hardships for many hundreds of thousands of eons. The blessed, thus-gone, worthy, perfect Buddha sat here cross-legged for seven days. While the blessed, thus-gone, worthy, perfect Buddha was seated here, many trillions of gods prostrated to the Blessed One upon seeing him; this was truly an excellent attainment for them. Someday, I too will awaken in a perfect manner to unexcelled and perfect buddhahood!’

source: དེས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་དང་ཐུན་མོང་དུ་བཟའ་བར་བྱའོ། ། གལ་ཏེ་ལ་ལ་ཞིག་འོངས་ནས་
en: “For eight days and nights, he wept uncontrollably at the foot of the Bodhi tree. As he did not partake of food or drink during that time, the gods of the pure abodes approached him and said, ‘Do not torment yourself like this. Instead, seek out the qualities of the Buddha.’

source: ལྷུང་བཟེད་དམ། ཆོས་གོས་སློང་ལ། གལ་ཏེ་སངས་རྒྱས་ཀྱིས་གནང་བའི་ཆོས་གོས་གསུམ་ལས་ལྷག་པར་གྱུར་ན་
en: “He asked, ‘Do you know the qualities of the Buddha?’

source: ཇི་ལྟར་བཏང་བ་བཞིན་དུ་སྦྱིན་པར་བྱའོ། ། གལ་ཏེ་དེ་ལ་ཆོས་གོས་གསུམ་ལས་ཉུང་བར་གྱུར་ན་གང་ལ་བརྟེན་ཏེ་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་དེ་ནི་ཡོངས་སུ་གཏང་བར་མི་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་གོས་གསུམ་གཏང་བར་མི་བྱའོ། ། ཞེས་གསུངས་པའི་ཕྱིར་རོ། །
en: “ ‘We do not know them,’ they replied. ‘However, we know that this body has been sustained by rice and gruel; make some effort to feed yourself! Do not hasten your own death!’

source: ཤཱ་རིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གོས་གསུམ་ཡོངས་སུ་བཏང་སྟེ། སློང་བ་པོ་གཙོ་བོར་བྱེད་པར་གྱུར་ན་དེས་འདོད་པ་ཆུང་བ་བསྟེན་པ་མ་ཡིན་ནོ། །
en: “ ‘My body is weak and I lack higher perception,’ he said. ‘Yet where should I go? This is the very place where I should die!’ He then wept for seven days and nights, shouting, ‘Let death come!’ Śāriputra, he then maintained that diligence for six hundred million eons. Śāriputra, after another two hundred fifty million eons, that bodhisattva awakened in a perfect manner to unexcelled and perfect buddhahood. After he awakened in a perfect manner to unexcelled and perfect buddhahood, he ripened a trillion sentient beings to the level where their progress toward unexcelled and perfect buddhahood was irreversible. The span of time this took place is unfathomable, and his community of śrāvakas was also immeasurable and unfathomable.

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་བྱུང་བ་དེས་ཆོས་ལ་ཀུན་ཏུ་བསྟེན་པར་བྱ་ཞིང་དེས་དེ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔས་གང་ཡང་སེ་གོལ་གཏོགས་པ་ཙམ་དུ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་བསྒོམ་པར་བྱ་སྟེ། འདི་ནི་སྦྱིན་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: “Śāriputra, why was he called Wise Diligence? Because he always exerted himself for emancipation. He always exerted himself in the application of diligence. He always exerted himself for erudition. Śāriputra, through such diligence, the bodhisattva Wise Diligence awakened in a perfect manner to unexcelled and perfect buddhahood.

source: ཤཱ་རིའི་བུ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞལ་ཏ་བྱེད་པར་ཤེས་པར་བྱ་ཞེ་ན། དེས་ཆོས་དང་འཐུན་པས་ཞལ་ཏ་བྱ་ཞིང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཡང་ཞལ་ཏ་བྱའོ། །
en: “Śāriputra, bodhisattvas who have four qualities will be endowed with insight, and they will quickly awaken in a perfect manner to unexcelled and perfect buddhahood. What are these four? Śāriputra, bodhisattvas receive many teachings. They retain and accumulate teachings. They respect practitioners of pure conduct who are elders, those who are novices, and those in between. When asked, they indicate the path with the right hand, saying, ‘This is the path. This is the path,’ and they exert themselves in teaching the Dharma. Śāriputra, bodhisattvas who have those four qualities will be endowed with insight, and they will quickly awaken in a perfect manner to unexcelled and perfect buddhahood.

source: མཁན་པོ་དང་སློབ་དཔོན་ལ་ཡང་གུས་པ་དང་བཅས་པར་བྱའོ། ། དེ་ལྟར་འདིས་བརྩོན་འགྲུས་བརྩམ་པར་བྱ་སྟེ། ཇི་ལྟར་ཇི་སྲིད་འཚོའི་མཐར་ཐུག་པའི་བར་དུ་གཉིད་དང་རྨུགས་པ་བསལ་བར་བྱ་སྟེ། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཞལ་ཏ་བྱེད་པའི་བྱ་བ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་ལ་ཐོས་པ་མང་པོ་ཚོལ་བའི་ཤེས་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་གང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ཐོབ་ནས་
en: “How should they seek out learning? They should renounce their own desires, abide by the scriptures of their preceptors and teachers, and pay respect to them.

source: ཐོས་པ་མང་པོ་ལ་མངོན་པར་བརྩོན་པར་མི་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདེན་པར་སྨྲ་བ་མ་ཡིན་པར་རིག་པར་བྱའོ། ། ཤཱ་རིའི་བུ་མིང་ཙམ་གྱིས་བླ་ན་
en: “They should abandon four qualities. What are these four? Sloth and torpor, useless chatter, aggression, and arrogance. They should abandon these four qualities.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ཀྱི། ཤེས་རབ་དང་ལྡན་པ་ཉིད་ཀྱིས་ནི་བླ་ན་
en: “They should cultivate four qualities. What are these four? They should habituate themselves to not lying down to sleep. They should apply themselves diligently and maintain the habit of walking in meditation. Without arrogance, they should respectfully serve preceptors and teachers. Arousing respect for others, they should uphold what they have learned, and, keeping it in mind, they should master its words. Those who possess those four qualities seek out learning.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ། །
en: “Through four qualities, teachers will be pleased. What are these four? Gentleness and affability, friendliness, abiding by the Dharma, and the ability to provide excellent explanations. Those who possess those four qualities will please teachers.

source: ཤེས་རབ་དེ་ཡང་གང་ལས་ངེས་པར་འབྱུང་བ་ཡིན་ཞེ་ན།
en: “Those who possess four qualities will be joyful. What are these four? Those whose search is meaningful will be joyful. Those who have the treasure of learning, those who possess the component of insight based on it, and those who give the gift of the Dharma to others will feel joy and delight. Bodhisattvas who have these four qualities will be joyful themselves.

source: མང་དུ་ཐོས་པ་ལས་ཤེས་རབ་འབྱུང་བ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་མངོན་སུམ་དུ་བྱ་ཞིང་ཁྱོད་ཀྱིས་སོ་སོར་རིག་པར་བྱའོ། །
en: “Respecting, venerating, and revering those who seek out learning in that way, bodhisattvas do not glorify themselves. Instead, just as they tame themselves, put themselves at peace, and pass into parinirvāṇa, they also tame others, put others at peace, and cause others to pass into parinirvāṇa. They do not act for their own benefit alone.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་མང་དུ་ཐོས་པ་ལ་ཇི་ལྟར་ཐེ་ཙོམ་སྐྱེ་བར་འགྱུར་ཞེས་གང་བྱང་ཆུབ་སེམས་དཔའ་དེ་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པར་བྱེད་པའི་བྱང་ཆུབ་ལ་བདུད་སྡིག་ཅན་བར་ཆད་བྱེད་པར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་བསྐྱེད་ནས་ཐོས་པ་མང་པོ་ལ་མངོན་པར་མི་བརྩོན་པ་གང་ཡིན་པ་དེ་ནི་བདུད་སྡིག་ཅན་གྱི་ཡོངས་སུ་བྱིན་གྱིས་བརླབས་པ་ཉིད་ཡིན་ནོ། ། དེ་ལྟ་བས་ན་ཤཱ་རིའི་བུ་བདུད་ཀྱི་ལས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་འདོད་པས་བརྩོན་འགྲུས་བརྩམ་པར་བྱ། ཚིག་གཙོ་བོར་མི་བྱ། མཁས་པའི་བྱ་བ་ཤེས་པར་བྱ་ཞིང་འཇིག་རྟེན་ཐམས་ཅད་ལ་གྲགས་པའི་བྱ་བ་ཤེས་པར་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་བརྩོན་འགྲུས་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཚུལ་ཁྲིམས་ཀྱིས་བླ་ན་
en: “Those who seek out and pursue learning in that way expand the insight related to their present life, so what need is there to mention the insight related to their next life? Insight is achieved through perseverance in learning. Bodhisattvas who do not persevere in learning should remember their yellow-colored robes. Thus, they should show respect to practitioners of pure conduct. When in their presence, they should not disparage them, speak, wash their own feet, use their tooth sticks, or spit. They should not make loud noises, speak without being asked, interrupt them, or leave without being bidden. They should not think about the past or future, they should not say a word, they should not engage in random discussions, and they should not engage in base talk. When they are questioned, others should not answer for them—those who are questioned must answer for themselves. They should not tell tales about thieves. Instead, they should rely on the sūtras. They should protect their own minds and the minds of others, and they should rely on the roots of virtue that are in harmony with that. They should help those who follow the genuine path leading to the awakening of the buddhas, without harming those who are not following it—they should never harm anyone of either sort. They should be wary or respectful of those who are angry at them, who accuse them of being wrong, who pose threats to their life, or create hindrances to their observance of pure conduct. They should even befriend them with fond words. They should perceive those from whom they receive instructions and those who engage in recitation as their teachers, and they should respect them. This is how bodhisattvas should show respect to practitioners of pure conduct.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: “How should they teach the path? They should explain the path with an even mind, with a mind that is pure, with correct perception, and with a mind free from hesitation. If they are not without doubt, they should first learn from those who know the path, and then teach it to others. Bodhisattvas who have those four qualities will quickly awaken in a perfect manner to unexcelled and perfect buddhahood.

source: ཤཱ་རིའི་བུ་གནས་འདི་དོན་དུ་གཉེར་བ་མང་ཡང་ནན་ཏན་གྱིས་ཡང་དག་པར་སྒྲུབ་པར་བྱེད་པ་ནི་མེད་དེ་དེ་ དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཡེ་ཤེས་དང་། སྨོན་ལམ་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ། །
en: “It is said:

source: དེ་ལྟ་བས་ན་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཐམས་ཅད་གང་གིས་དགའ་བར་འགྱུར་བའི་ཚིག་དེ་སྨྲ་བར་བྱ། བྱང་ཆུབ་སེམས་དཔས་བདག་གི་དོན་དུ་སྨྲ་བར་མི་བྱ། བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་དམན་པར་མི་བྱའོ། ། ཤཱ་རིའི་བུ་སྟོང་དུ་བགྲངས་པ་ལས་གཅིག་འགྲུབ་པའམ། འགྲུབ་པ་མེད་ཅིང་ཤཱ་རིའི་བུ་སྟོང་ཕྲག་བཅུ་དང་། སྟོང་ཕྲག་ཉི་ཤུ་དང་། སྟོང་ཕྲག་སུམ་ཅུ་དང་། སྟོང་ཕྲག་བཞི་བཅུ་དང་། སྟོང་ཕྲག་ལྔ་བཅུ་དང་། བྱེ་བ་ཕྲག་སྟོང་དུ་བགྲང་བ་ལས་གཅིག་འགྲུབ་པའམ། འགྲུབ་པ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་ལྟར་གང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལ་གནས་པ་དེ་ནི་མངོན་པར་འབྱུང་བར་དཀའ་བ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བས་འདི་ལྟར་སེམས་བསྐྱེད་པར་བྱ་སྟེ། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མནག་དཀའ་བ་མནག་པར་བྱ།
en: “Those who show proper reverence,

source: བཟོད་དཀའ་བ་བཟོད་པར་བྱ་ཞིང་བདག་གིས་ཆོས་བཙལ་བར་བྱ་བའི་ཕྱིར། མངོན་པར་དགའ་བས་བརྩོན་པར་བྱའི་ལོངས་སྤྱོད་བཙལ་བའི་ཕྱིར་ནི་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཚོལ་བར་བྱེད་པ་ནི་ཡེ་ཤེས་ཚོལ་བར་བྱེད་པ་ཡིན་ཏེ།
en: Who listen to the Dharma properly,

source: འདོད་པ་རྙེད་པས་རློམ་པར་མི་བྱེད། རབ་ཏུ་རློམ་པར་མི་བྱེད་དོ། ། དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་རབ་གཙོ་བོར་བྱའི་ལོངས་སྤྱོད་གཙོ་བོར་མི་བྱའོ། །
en: And who properly focus on what is meaningful

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་གང་ཆོས་ཀྱི་སྦྱིན་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་བརྩོན་པར་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་མང་དུ་ཐོས་པའི་ཤེས་པ་བཙལ་བར་བྱ་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་གང་ཐོས་པའི་ལེགས་པར་བཤད་པ་དེ་ཁྱེར་ལ་ཤོག་ཅེས་ཕྱོགས་བཞིར་སྐྱེས་བུ་བཞི་གཏང་བར་བྱ། ཁྱེད་ཅག་རྣམས་ཀྱིས་དེ་རྣམས་ན་བའི་ཉེ་གནས་དང་། ནད་གཡོག་གི་དོན་དུ་སྤྲོ་བར་བྱའོ་ཞེས་སྐྱེས་བུ་གཞན་བཞི་ཡང་གཏང་བར་བྱ་སྟེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཕྱོགས་བཞིར་བྱམས་པའི་སེམས་ཀྱིས་ཁྱབ་པར་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བའི་བློ་གཞག་པར་ཡང་བྱ།
en: Perfect all qualities.

source: ཕྱོགས་གང་དུ་ཆོས་ཐོས་པའི་ཕྱོགས་དེར་ཡང་འགྲོ་བར་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཆོས་བཙལ་བར་བྱ་སྟེ།
en: “While they seek out the Dharma

source: འདི་ནི་མང་དུ་ཐོས་པ་ཚོལ་བ་ཤེས་པ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པར་བྱེད་པ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པའི་བརྩོན་འགྲུས་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏེ། དུས་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལེགས་སྐྱེས་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། དེའི་བསྟན་པ་གནས་པར་གྱུར་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པའི་བརྩོན་འགྲུས་ཞེས་བྱ་བ་དེ་མཆོད་རྟེན་ལ་ཕྱག་འཚལ་ཞིང་རྒྱུ་བ་ན་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ག་ལ་བ་དེ་ལོགས་སུ་སོང་སྟེ་
en: For the benefit of living beings,

source: ཕྱིན་ནས དེས་བྱང་ཆུབ་ཀྱི་ཤིང་དེ་མཐོང་བ་ན་རབ་ཏུ་ངུ་ཞིང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་འདི་ལ་བཞུགས་ནས།
en: They attend the preceptors

source: བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་འདིར་བདུད་དཔུང་དང་བཅས་བཞོན་པ་དང་བཅས་པ་བཏུལ་ཏེ། སེང་གེའི་ཁྲི་འདིའི་དོན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མར་དཀའ་བ་སྤྱད་དེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་འདི་ལ་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཞག་བདུན་བཞུགས་སོ། ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་ལ་བཞུགས་པ་ན། བཅོམ་ལྡན་འདས་དེ་མཐོང་ནས་ལྷ་བྱེ་བ་ས་ཡ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཕྱག་འཚལ་བ་གང་ཡིན་པའི་ལྷ་དེ་དག་ནི་རྙེད་པ་ལེགས་པར་རྙེད་པ་ཡིན་ནོ། །
en: And serve them respectfully.

source: གང་བདག་ཀྱང་དུས་ནམ་ཞིག་ན་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞེས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་རྩ་བ་དེ་ལ་ཉིན་མཚན་བརྒྱད་དུ་རབ་ཏུ་ངུ་བར་གྱུར་ཏེ
en: “Always loving,

source: དེའི་བར་དུ་བཟའ་བའམ། བཏུང་བ་ལ་ལོངས་མ་སྤྱད་པར་གནས་པར་གྱུར་པ་ན།
en: Thankful, filled with gratitude,

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་ཉེ་བར་འོངས་ནས་དེ་ལ་འདི་སྐད་ཅེས་ལྷག་པར་གདུང་བ་མ་བྱེད་པར་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གང་ཡིན་པ་དེ་ཡོངས་སུ་ཚོལ་ཅིག །
en: With a perfect sense of shame and decency,

source: ཅེས་སྨྲས་སོ། །
en: They abandon jealousy and hypocrisy.

source: དེས་སྨྲས་པ། ཁྱེད་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཤེས་སམ། དེ་དག་གིས་བདག་ཅག་གིས་ནི་མི་ཤེས་མོད་ཀྱི། འོན་ཀྱང་ལུས་འདི་ལ་འབྲས་ཆན་དང་ཟན་དྲོན་གྱིས་གསོས་ཏེ
en: “Recognizing the preciousness

source: བཟའ་བ་བཙལ་བ་ལ་བརྩོན་པར་གྱིས་ལ་ཁྱོད་མྱུར་དུ་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་བ་མ་བྱེད་ཅིག་ཅེས་སྨྲས་སོ། ། དེས་ལུས་ཉམ་ཆུང་བར་ནི་མངོན་པར་ཤེས་པ་མེད་ཀྱི་འོན་ཀྱང་གང་དུ་འགྲོ་བར་བྱ་སྟེ། འདི་ཉིད་དུ་བདག་འཆི་བའི་དུས་བྱེད་པར་བྱའོ་ཞེས་ཉིན་མཚན་བདུན་དུ་ངུ་ཞིང་འཆི་བའི་དུས་བྱའོ་ཞེས་སྨྲས་སོ། ། ཤཱ་རིའི་བུ་བརྩོན་འགྲུས་དེས་བསྐལ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཕྱིར་བསྙིལ་བར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་དེའི་འོག་ཏུ་བསྐལ་པ་བྱེ་བ་ཉི་ཤུ་རྩ་ལྔས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Of that which heals the sick and is hard to find,

source: དེས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། ། དེའི་ཚེའི་ཚད་ནི་དཔག་ཏུ་མེད་ཅིང་འདིའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་ཚད་མེད་ཅིང་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་ཅིའི་ཕྱིར་མཁས་པའི་བརྩོན་འགྲུས་ཞེས་བྱ་ཞེ་ན། དེ་དུས་ཐམས་ཅད་དུ་ངེས་པར་འབྱུང་བ་ལ་བརྩོན་པ་དང་། དུས་ཐམས་ཅད་དུ་བརྩོན་འགྲུས་རྩོམ་པ་ལ་བརྩོན་པ་དང་། དུས་ཐམས་ཅད་དུ་ཐོས་པ་མང་པོ་ལ་བརྩོན་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་བརྩོན་འགྲུས་འདིས་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པའི་བརྩོན་འགྲུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། ། ཤཱ་རིའི་བུ་ཆོས་བཞི་དང་ལྡན་ན་ བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་དང་ལྡན་ཞིང་མྱུར་དུ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཐོས་པ་མང་བ་ཡིན། ཐོས་པ་འཛིན་པ་ཡིན། ཐོས་པ་བསགས་པ་ཡིན། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྒན་རབས་དང་། བར་མ་དང་། གསར་བུ་ལ་གུས་པ་དང་བཅས་པ་ཡིན། དྲིས་ན་ལག་པ་གཡས་པས་ལམ་ནི་འདིའོ། །
en: They rest in that recognition

source: ལམ་ནི་འདིའོ་ཞེས་ཉེ་བར་སྟོན་པ་ཡིན་ཞིང་ཆོས་སྟོན་པ་ལ་བརྩོན་པ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་
en: And seek out the excellent teachings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་དང་ལྡན་པར་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: “While learning, they become happy,

source: དེ་ལ་ཇི་ལྟར་ཐོས་པ་བཙལ་བར་བྱ་ཞེ་ན། རང་གི་འདོད་པ་བཏང་སྟེ་མཁན་པོ་དང་། སློབ་དཔོན་གྱི་གཞུང་ལ་རབ་ཏུ་གནས་པ་དང་། གུས་པ་དང་བཅས་པར་བྱའོ། །
en: And sharp insight arises in them.

source: ཆོས་བཞི་རྣམ་པར་སྤང་བར་བྱ་བ་ཡིན་ཏེ། བཞི་གང་ཞེ་ན། གཉིད་དང་། རྨུགས་པ་དང་། བྲེ་མོའི་གཏམ་དང་། ཁྲོ་བ་དང་། ཁེངས་པ་ཉིད་དེ། ཆོས་བཞི་པོ་འདི་དག་རྣམ་པར་སྤང་བར་བྱའོ། ། ཆོས་བཞི་དག་ལ་གོམས་པར་བྱ་བ་ཡིན་ཏེ། བཞི་གང་ཞེ་ན། མི་ཉལ་བ་ལ་གོམས་པ་དང་། བརྩོན་འགྲུས་བརྩམས་ཤིང་འཆག་པའི་རང་བཞིན་ཅན་དུ་བྱ་བ་དང་། མཁན་པོ་དང་སློབ་དཔོན་གྱི་བསྙེན་བཀུར་ལ་གུས་པ་དང་བཅས་ཤིང་ཁེངས་པ་མེད་པ་དང་། གཞན་དག་ལ་གུས་པ་བསྐྱེད་པས་ཐོས་པ་འཛིན་པ་དང་། དེ་སེམས་ལ་བཞག་ནས་ ཚིག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྟེ། ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཐོས་པ་ཚོལ་བ་ཡིན་ནོ། །
en: From desire, anger, and ignorance
